package com.zhuravishkin.courses.leetcode.binary_search;

import java.util.List;

/**
 * 1408C. Дискретное ускорение (https://codeforces.com/problemset/problem/1408/C?locale=ru)
 * Рассмотрим дорогу длиной l метров. Начало дороги имеет координату 0, конец дороги имеет координату l.
 * Есть две машины, первая стоит в начале дороги, вторая стоит в конце дороги. Они начинают ехать одновременно.
 * Первая машина будет ехать от начала дороги к концу, вторая машина будет ехать от конца дороги к началу.
 * Изначально они будут ехать со скоростью 1 метр в секунду. Есть n флажков, расположенных в различных координатах a1,a2,…,an.
 * Каждый раз, когда любая из двух машин проезжает мимо флажка, скорость этой машины увеличивается на 1 метр в секунду.
 * Найдите, через какое время машины встретятся (их координаты совпадут).
 * Входные данные
 * В первой строке находится единственное целое число t(1≤t≤10^4): количество наборов входных данных.
 * В первой строке описания каждого набора входных данных находятся два целых числа n, l (1≤n≤10^5, 1≤l≤10^9): количество флажков и длина дороги.
 * Во второй строке находятся n целых чисел a1,a2,…,an в возрастающем порядке (1≤a1<a2<…<an<l).
 * Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 10^5.
 * Выходные данные
 * Для каждого набора входных данных выведите единственное вещественное число: время, через которое машины встретятся.
 * Ваш ответ будет признан правильным, если его абсолютная или относительная ошибка не превосходит 10^−6. Более формально, если ваш ответ a и ответ жюри b,
 * ваш ответ будет признан правильным, если |a−b|/max(1,b)≤10^−6.
 * Constraints:
 * ограничение по времени на тест: 3 секунды
 * ограничение по памяти на тест: 256 мегабайт
 */
public class DiscreteAcceleration {
    public static void main(String[] args) {
    }

    public static List<String> stringMatching(String[] words) {
        return null;
    }
}
